# Дано целое число N. Выведите следующее за ним четное число.

x = int(input())
print(x+(2-x % 2))
