# Дано натуральное число. Выведите его последнюю цифру.

n = input()
print(int(n) // 10)
